import Foundation
import PlaygroundSupport

/// Closure Capture
///
/// 클로저는 클로저 외부에 있는 값을 사용할 때 캡처해서 사용함 (값, 참조타입 전부)
/// - 이때 클로저 생성 (선언) 시점이 아닌, 실행 시점의 값이 사용됨
/// - 캡처리스트를 사용한 경우 선언 시점의 값이 사용됨

var count = 1
let closure: (() -> ()) = {
    print("1️⃣ 클로저 값: \(count)")
}

count = 100
closure()

let closure2: (() -> ()) = { [count] in
    print("2️⃣ 클로저 값: \(count)")
}

count = 1000
closure2()

/// 클로저는 참조타입이기 때문에 heap 메모리에 저장됨
/// - 클로저 내부에서 사용하는 변수는 캡처리스트 사용 유무, 값/참조 타입 유무에 따라 다름
///
/// 캡처리스트 X
/// 값타입
/// - 기존 stack에 저장되어 있던 변수를 box로 감싸서 heap에 할당함
/// - 기존 변수는 heap에 box를 참조하도록 변경, 클로저도 heap에 box를 참조
/// -> 기존 stack에 저장되어 있던 변수는 함수 종료 시 해제됨
///
/// 참조타입
/// - RC를 증가시키며 참조함
///
/// 캡처리스트 O
/// 값타입
/// - 그 시점의 값을 복사하여 클로저의 스토리지에 저장함 (heap)
/// - 기존 값은 참조하지 않음
///
/// 참조타입
/// - 여전히 참조함 (weak, unowned로 선언한 경우 RC 증가 X)

struct Person {
    var name: String
    var old: Int
}

class Pet {
    var name: String
    var old: Int
    
    init(name: String, old: Int) {
        self.name = name
        self.old = old
    }
    
    deinit {
        print("✋ \(name) deinit")
    }
}

func closure3Create() -> (() -> ()) {
    var 유재석 = Person(name: "유재석", old: 20) // stack -> heap
    var 뽀삐 = Pet(name: "뽀삐", old: 5) // stack -> heap
    
    print("3️⃣ 함수 시작")
    print(유재석.name, 유재석.old)
    print(뽀삐.name, 뽀삐.old)

    let closure = { [pet = 뽀삐, personOld = 유재석.old] in
        defer {
            print("🔚 클로저 종료")
        }
        
        //personOld = 50 // 복사된 상수 값은 수정 불가
        유재석.old = 50 // 캡처리스트에 없기 때문에 캡처
        pet.old = 50 // 캡처리스트에 있지만 참조타입이기 때문에 캡처
        
        print("🎬 클로저 실행")
        print(유재석.name, 유재석.old)
        print(pet.name, pet.old)
    }
    
    print("🔚 함수 종료")
    return closure
}

var closure3: (() -> ())? = closure3Create()
closure3?() // create 함수 종료 이후에도 유재석, 뽀삐 변수에 접근 가능

closure3 = nil // rc가 0이 되어 뽀삐 deinit
